Repository: lhamot/DroneWars
Catalog: */LC_MESSAGES/DroneWars.po
Languages: fr_fr

source: %1% expect a number in the range [1: %2%]
fr_fr: %1% attend un nombre entre 1 et %2% compris.

source: %1% expect a building number in the range [1: %2%]
fr_fr: attend un numero de batiment entre 1 et %2% compris

source: Log failed
fr_fr: Tentative d'écriture dans le journal sans avoir la competence "Journal".

source: Too much items in your planet memory for your Memory skill level.
fr_fr: Il y as trop d'élément dans votre planète par rapport à votre niveau dans la competance Mémoire.

source: Procedure "%1%" not found.
fr_fr: Procédure "%1%" introuvable.

source: Your emition rate don't allow to send so much elements
fr_fr: Votre débit ne permet pas d'envoyer autant d'éléments.

source: You can create up to {1} planets.
fr_fr: Vous pouvez créer jusqu'as {1} planètes.

source: You can create up to {1} fleets.
fr_fr: Vous pouvez créer jusqu'as {1} flottes.

source: Your fleets can contains up to {1} ships.
fr_fr: Vos flottes peuvent contenir jusqu'as {1} vaisseaux.

source: You can filter your messages
fr_fr: Vous pouvez filter vos messages (Pas encors implementé)

source: You can now store up to {1} events.
fr_fr: Vous pouvez stocker jusqu'as {1} evenements.

source: You can use the "age()" procedure on your fleets and planets
fr_fr: Vous pouvez utiliser la procedure ":age()" sur vos flottes et planètes.

source: Your store up to {1} items in the "memory" of your fleets and planets
fr_fr: Vous pouvez stocker jusqu'as {1} éléments dans la "memoire" de vos flottes et planètes.

source: Your messages can reachs up to {1} cases
fr_fr: Vos transmissions peuvent atteindre jusqu'as {1} cases de distance.

source: A fleet with {1} ships has 50% of probability to escape.
fr_fr: Une flotte avec {1} vaisseaux à 50% de chance de s'enfuire.

source: You can use the "log" function to create custom events
fr_fr: Vous pouvez utiliser la fonction "log" pour créer des évenement personalisés.

source: You can't use the "log" function to create custom events
fr_fr: Vous ne pouvez pas utiliser la fonction "log" pour créer des évenement personalisés.

source: Each call to "simulates" function process {1} simulations
fr_fr: Chaque appel à la fonction "simulate" génere {1} simulations.

source: Each call to "simulates" function return false
fr_fr: Chaque appel à la fonction "simulate" retourne "faux".

source: You can't receive fight report from destroyed fleets
fr_fr: Vous ne pouvez recevoir les rapports de combat des flottes détruites.

source: You receive fight report from destroyed fleets
fr_fr: Vous recevez les rapports de combat des flottes, même si elles sont détruites.

source: Your messages emit up to {1} values per round
fr_fr: Vos transmissions peuvent contenir jusqu'as {1} éléments.

source: my_planet
fr_fr: ma_planete

source: fleets
fr_fr: flottes

source: order
fr_fr: ordre

source: PLANET_ACTION_CODE_COMMENT
fr_fr: Cette procédure décrit le comportment d'une planète à chaque tour. Elle recois deux variables : Une "planète" qui représente la planète dont c'est le tour de jouer, et une variable "flottes" qui contient la liste des flottes présentes aux allentour de la planète. Cette procedure retourne la variable "ordre" qui contient l'ordre a donner aux battisseurs présent sur la planète.

source: my_fleet
fr_fr: ma_flotte

source: otherFleet
fr_fr: autre_flotte

source: local_planet
fr_fr: planete_locale

source: DO_GATHER_CODE_COMMENT
fr_fr: Cette procedure permet à un capitaine de décider si sa flotte doit fusioner avec une autre flotte allié présente dans la mème zone. En entrée elle recois votre flote "ma_flotte" et la flotte allié "autre_flotte", ce qui doit lui permetre de décider si il vaut mieu fusioner ou non.

source: DO_FIGHT_CODE_COMMENT
fr_fr: Cette procedure permet a un capitaine de décider si sa flotte doit combatre ou fuire. En entrée elle recois votre flote "ma_flotte" et la flotte enemie "autre_flotte", ce qui doit lui permetre de décider si il vaut mieu combatre ou fuire.

source: FLEET_ACTION_CODE_COMMENT
fr_fr: Cette procédure décrit le comportment d'une flotte à chaque tour. Elle recois deux variables : Une "ma_flotte" qui représente la flotte dont c'est le tour de jouer, et une variable "planètes" qui peut contenir une planète si il y en as une dans la mème zone. Cette procedure retourne la variable "ordre" qui contient l'ordre à donner aux vaisseaux de la flotte.

source: myself_player
fr_fr: moi_meme

source: other_player
fr_fr: autre_joueur
